cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1230C3PM.svd.xml
        <register>
          <name>SSDC1</name>
          <description>ADC Sample Sequence 1 Digital Comparator Select</description>
          <addressOffset>0x00000074</addressOffset>
          <fields>
            <field>
              <name>ADC_SSDC1_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC1_S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC1_S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC1_S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX2</name>
          <description>ADC Sample Sequence Input Multiplexer Select 2</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX2_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX1</name>
              <description>2nd Sample Input Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX2</name>
              <description>3rd Sample Input Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX3</name>
              <description>4th Sample Input Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL2</name>
          <description>ADC Sample Sequence Control 2</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL2_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_D1</name>
              <description>2nd Sample Diff Input Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_D2</name>
              <description>3rd Sample Diff Input Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_D3</name>
              <description>4th Sample Diff Input Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END3</name>
              <description>4th Sample is End of Sequence</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO2</name>
          <description>ADC Sample Sequence Result FIFO 2</description>
          <addressOffset>0x00000088</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO2_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT2</name>
          <description>ADC Sample Sequence FIFO 2 Status</description>
          <addressOffset>0x0000008C</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT2_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT2_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT2_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT2_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSOP2</name>
          <description>ADC Sample Sequence 2 Operation</description>
          <addressOffset>0x00000090</addressOffset>
          <fields>
            <field>
              <name>ADC_SSOP2_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP2_S1DCOP</name>
              <description>Sample 1 Digital Comparator Operation</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP2_S2DCOP</name>
              <description>Sample 2 Digital Comparator Operation</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP2_S3DCOP</name>
              <description>Sample 3 Digital Comparator Operation</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC2</name>
          <description>ADC Sample Sequence 2 Digital Comparator Select</description>
          <addressOffset>0x00000094</addressOffset>
          <fields>
            <field>
              <name>ADC_SSDC2_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC2_S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC2_S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC2_S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX3</name>
          <description>ADC Sample Sequence Input Multiplexer Select 3</description>
          <addressOffset>0x000000A0</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX3_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL3</name>
          <description>ADC Sample Sequence Control 3</description>
          <addressOffset>0x000000A4</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL3_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO3</name>
          <description>ADC Sample Sequence Result FIFO 3</description>
          <addressOffset>0x000000A8</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO3_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT3</name>
          <description>ADC Sample Sequence FIFO 3 Status</description>
          <addressOffset>0x000000AC</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT3_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSOP3</name>
          <description>ADC Sample Sequence 3 Operation</description>
          <addressOffset>0x000000B0</addressOffset>
          <fields>
            <field>
              <name>ADC_SSOP3_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC3</name>
          <description>ADC Sample Sequence 3 Digital Comparator Select</description>
          <addressOffset>0x000000B4</addressOffset>
          <fields>
            <field>
              <name>ADC_SSDC3_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRIC</name>
          <description>ADC Digital Comparator Reset Initial Conditions</description>
          <addressOffset>0x00000D00</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADC_DCRIC_DCINT0</name>
              <description>Digital Comparator Interrupt 0</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT1</name>
              <description>Digital Comparator Interrupt 1</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT2</name>
              <description>Digital Comparator Interrupt 2</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT3</name>
              <description>Digital Comparator Interrupt 3</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT4</name>
              <description>Digital Comparator Interrupt 4</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT5</name>
              <description>Digital Comparator Interrupt 5</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT6</name>
              <description>Digital Comparator Interrupt 6</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT7</name>
              <description>Digital Comparator Interrupt 7</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG0</name>
              <description>Digital Comparator Trigger 0</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG1</name>
              <description>Digital Comparator Trigger 1</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG2</name>
              <description>Digital Comparator Trigger 2</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG3</name>
              <description>Digital Comparator Trigger 3</description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG4</name>
              <description>Digital Comparator Trigger 4</description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG5</name>
              <description>Digital Comparator Trigger 5</description>
              <bitRange>[21:21]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG6</name>
              <description>Digital Comparator Trigger 6</description>
              <bitRange>[22:22]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG7</name>
              <description>Digital Comparator Trigger 7</description>
              <bitRange>[23:23]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL0</name>
          <description>ADC Digital Comparator Control 0</description>
          <addressOffset>0x00000E00</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL0_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL1</name>
          <description>ADC Digital Comparator Control 1</description>
          <addressOffset>0x00000E04</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL1_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
